In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [5]:
df

          W         X         Y         Z
A -0.153407 -1.294022 -1.167890  0.213919
B -0.845111  1.613280  1.028884 -0.590095
C -0.833803  1.285330 -0.204622  1.418005
D  0.022488  0.662438 -0.135538 -0.455647
E -0.158478  0.446233 -0.734500  0.078672

In [6]:
df['W']

A   -0.153407
B   -0.845111
C   -0.833803
D    0.022488
E   -0.158478
Name: W, dtype: float64

In [7]:
df.W  # hanya utk yg simple (tidak direkomendasikan)

A   -0.153407
B   -0.845111
C   -0.833803
D    0.022488
E   -0.158478
Name: W, dtype: float64

In [8]:
df[['W','Z']]

          W         Z
A -0.153407  0.213919
B -0.845111 -0.590095
C -0.833803  1.418005
D  0.022488 -0.455647
E -0.158478  0.078672

In [9]:
df[['W','X','Z']]

          W         X         Z
A -0.153407 -1.294022  0.213919
B -0.845111  1.613280 -0.590095
C -0.833803  1.285330  1.418005
D  0.022488  0.662438 -0.455647
E -0.158478  0.446233  0.078672

In [10]:
df['baru'] = df['W'] + df['Y']

In [11]:
df

          W         X         Y         Z      baru
A -0.153407 -1.294022 -1.167890  0.213919 -1.321298
B -0.845111  1.613280  1.028884 -0.590095  0.183773
C -0.833803  1.285330 -0.204622  1.418005 -1.038425
D  0.022488  0.662438 -0.135538 -0.455647 -0.113050
E -0.158478  0.446233 -0.734500  0.078672 -0.892977

In [12]:
df.drop('baru',axis=1)  # AXIS: 0 = index, 1 = kolom

          W         X         Y         Z
A -0.153407 -1.294022 -1.167890  0.213919
B -0.845111  1.613280  1.028884 -0.590095
C -0.833803  1.285330 -0.204622  1.418005
D  0.022488  0.662438 -0.135538 -0.455647
E -0.158478  0.446233 -0.734500  0.078672

In [13]:
df

          W         X         Y         Z      baru
A -0.153407 -1.294022 -1.167890  0.213919 -1.321298
B -0.845111  1.613280  1.028884 -0.590095  0.183773
C -0.833803  1.285330 -0.204622  1.418005 -1.038425
D  0.022488  0.662438 -0.135538 -0.455647 -0.113050
E -0.158478  0.446233 -0.734500  0.078672 -0.892977

In [14]:
df.drop('baru',axis=1,inplace=True)

In [15]:
df

          W         X         Y         Z
A -0.153407 -1.294022 -1.167890  0.213919
B -0.845111  1.613280  1.028884 -0.590095
C -0.833803  1.285330 -0.204622  1.418005
D  0.022488  0.662438 -0.135538 -0.455647
E -0.158478  0.446233 -0.734500  0.078672

In [16]:
df.drop('E',axis=0)

          W         X         Y         Z
A -0.153407 -1.294022 -1.167890  0.213919
B -0.845111  1.613280  1.028884 -0.590095
C -0.833803  1.285330 -0.204622  1.418005
D  0.022488  0.662438 -0.135538 -0.455647

In [17]:
df.loc['A']

W   -0.153407
X   -1.294022
Y   -1.167890
Z    0.213919
Name: A, dtype: float64

In [19]:
df.loc['C']

W   -0.833803
X    1.285330
Y   -0.204622
Z    1.418005
Name: C, dtype: float64

In [20]:
df.iloc[2]

W   -0.833803
X    1.285330
Y   -0.204622
Z    1.418005
Name: C, dtype: float64

In [21]:
df.loc['C','Z']

1.4180045573254958

In [22]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.153407 -1.167890
B -0.845111  1.028884

In [23]:
df > 0

       W      X      Y      Z
A  False  False  False   True
B  False   True   True  False
C  False   True  False   True
D   True   True  False  False
E  False   True  False   True

In [24]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN  0.213919
B       NaN  1.613280  1.028884       NaN
C       NaN  1.285330       NaN  1.418005
D  0.022488  0.662438       NaN       NaN
E       NaN  0.446233       NaN  0.078672

In [26]:
df[df['Z']>0]

          W         X         Y         Z
A -0.153407 -1.294022 -1.167890  0.213919
C -0.833803  1.285330 -0.204622  1.418005
E -0.158478  0.446233 -0.734500  0.078672

In [28]:
df[df['Z']>0]

          W         X         Y         Z
A -0.153407 -1.294022 -1.167890  0.213919
C -0.833803  1.285330 -0.204622  1.418005
E -0.158478  0.446233 -0.734500  0.078672

In [30]:
df[df['Z']>0]['X']

A   -1.294022
C    1.285330
E    0.446233
Name: X, dtype: float64

In [32]:
df[df['Z']>0][['X','Y']]

          X         Y
A -1.294022 -1.167890
C  1.285330 -0.204622
E  0.446233 -0.734500

In [34]:
df[(df['Z']>0) & (df['X']>1)]

          W        X         Y         Z
C -0.833803  1.28533 -0.204622  1.418005

In [36]:
df[(df['Z']>0) | (df['X']>1)]

          W         X         Y         Z
A -0.153407 -1.294022 -1.167890  0.213919
B -0.845111  1.613280  1.028884 -0.590095
C -0.833803  1.285330 -0.204622  1.418005
E -0.158478  0.446233 -0.734500  0.078672